title: Network Share Access via net use with Explicit Credentials
status: experimental
description: 
  Detects usage of the net use command to connect to a network share
  with explicitly supplied credentials and persistent connection.
author: Cisco Talos

logsource:
  product: windows
  category: process_creation

detection:
  selection_image:
    Image|endswith:
      - '\net.exe'
      - '\net1.exe'

  selection_args:
    CommandLine|contains|all:
      - ' use '
      - '\\\\'
      - '/user:'
      - '/p:yes'

  condition: selection_image and selection_args

level: high
