title: WDigest UseLogonCredential Registry Modification
status: experimental
description: Detects registry modification that enables WDigest UseLogonCredential,
  which allows plaintext credentials to be stored in memory.
author: Cisco Talos

logsource:
  product: windows
  category: process_creation

detection:
  selection_image:
    Image|endswith:
      - '\reg.exe'

  selection_args:
    CommandLine|contains|all:
      - 'add'
      - 'HKLM\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest'
      - 'UseLogonCredential'
      - '/d 1'

  condition: selection_image and selection_args

level: high
